package com.javaguru.student_igors_gergeleziu.lesson_2.level_2;
//Дан код, нужно сделать этот код запускаемым.

class LoginService {

    public static void main(String[] args) {
        System.out.println("You can login!");
    }


}
