package com.javaguru.student_ivan_shulga.lesson_5.level_3_junior;

class ForLoopDefinition5_5 { // тут сбита нумерация в условиях задач

    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.println(i);
        }
    }
}

/*
Найдите логическую ошибку в программе и исправить её:

class ForLoopDefinition5 {

    public static void main(String[] args) {
        for (int i = 0; i < 10; i++)
            System.out.println(i);
        }
    }

}
 */