package com.javaguru.student_ivan_shulga.lesson_2.level_x;

import com.javaguru.teacher.codereview.CodeReview;

@CodeReview(approved = true)
class Super_task_4 {

    // java - типизированный язык программирования

    /*
    Нетипизированные языки
    Нетипизированные или бестиповые языки, как правило — очень старые низкоуровневые языки,
    на которых программы являются набором машинных команд и пишутся, в основном, для взаимодействия
    с аппаратным обеспечением. Бестиповые языки позволяют производить любые операции над любыми данными,
    которые представлены в них как цепочки бит произвольной длины.

    Типизированные языки
    Типизированные языки сделали разработку программ более осмысленной и эффективной. Этот факт оказался
    настолько весомым, что в основу всех современных языков легло такое фундаментальное понятие, как система типов.
    По причине того, что авторы пытались решить разные задачи, создаваемые ими языки стали различаться по видам типизации.
     */

}
