package com.javaguru.student_ivan_shulga.lesson_11.level_1_intern;

class Task_2 {




}
/*
ArrayList и т.д. не умеют работать с примитивными типами. Поэтому если Вы хотите сохранять примитивные типы,
Вам нужно использовать классы-оболочки для соответствующих типов. Таким образом для типа int класс-оболочка Integer, для типа double – Double и т.д.
 */

/*
Что может хранить java.util.List: примитивные типы данных или ссылки на объекты,
или то и другое? Напишите программу, в которой кодом продемонстрируйте ответ на вопрос.

 */