package com.javaguru.student_nikolajs_sersnovs.lesson_6.level_4_junior;
/*
Как выйти из бесконечного цикла?
Найдите в интернете и напишите пример кода
для циклов while
 */
class Task_16_while {

    public static void main(String[] args) {
        while (true) {
            System.out.println(true);
            return;
        }

    }
}
