package com.javaguru.student_nikolajs_sersnovs.lesson_6.level_4_junior;

/*
Как досрочно закончить текущую итерацию цикла?
Найдите ответ в интернете и напишите пример кода
для циклов while.
 */
class Task_17_while {
    public static void main(String[] args) {
        while (true) {
            System.out.println(true);
            break;
        }

    }
}
