package com.javaguru.student_nikolajs_sersnovs.lesson_6.level_4_junior;

/*
Как досрочно закончить текущую итерацию цикла?
Найдите ответ в интернете и напишите пример кода
для циклов for.
 */
class Task_17_for {
    public static void main(String[] args) {
        for (; ; ) {
            System.out.println(";");
            break;

        }

    }
}
