package com.javaguru.student_nikolajs_sersnovs.lesson_6.level_4_junior;
/*
Как выйти из бесконечного цикла?
Найдите в интернете и напишите пример кода
для циклов for.
 */
class Task_16_for {

        public static void main(String[] args) {
            for (;;) {
                System.out.println(";");
                return;

            }


        }
    }

