package com.javaguru.student_ivan_shulga.lesson_9.level_3_junior;

/*
Кроме обычных классов в Java есть абстрактные классы. Абстрактный класс похож на обычный класс.
В абстрактном классе также можно определить поля и методы, но в то же время нельзя создать объект или экземпляр абстрактного класса.
Абстрактные классы призваны предоставлять базовый функционал для классов-наследников.
А производные классы уже реализуют этот функционал.
 */

class Task_10 {

}

/*
Что такое абстрактный класс?
Можно ли создать экземпляр абстрактного класса
в момент выполнения программы?
 */