package com.javaguru.student_ivan_shulga.lesson_9.level_2_intern;

import com.javaguru.teacher.codereview.CodeReview;

@CodeReview(approved = true)
class Task_5 {

    /*
Java не поддерживает множественное наследование. Это значит, что класс не может продлить более одного класса.
Значит, следующее утверждение НЕВЕРНО:
public class extends Animal, Mammal{}
---------------------
Проблема с множественным наследованием состоит в том, что два класса могут определять разные способы выполнения одной и той же вещи,
а подкласс не может выбрать, какой из них выбрать.
     */

}
/*
Что такое множественное наследование
в программировании?
Разрешено ли множественное наследование в Java?
 */