package main.java.com.javaguru.student_anastasija_meiksane.lesson_5.level_2_intern;
/*Написать программу, в которой:
        - создать массив целых чисел длиной 3,
        - заполнить каждую ячейку массива любым числом,
        - вывести значение каждой ячейки на консоль.
 */

 class Task_10 {

     public static void main(String[] args ){
          int[] showNumbers= new int[3];
                  showNumbers[0]=10;
                  showNumbers[1]=2;
                  showNumbers[2]=5;

                  System.out.println(showNumbers[0]);
                  System.out.println(showNumbers[1]);
                  System.out.println(showNumbers[2]);
     }
 }